janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define USE_PROTOTYPE 0

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U, /* Input direction */
    kPIN_MUX_DirectionOutput = 1U, /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C"
{
#endif

typedef enum _pinIdx
{
    PIN0_IDX,
    PIN1_IDX,
    PIN2_IDX,
    PIN3_IDX,
    PIN4_IDX,
    PIN5_IDX,
    PIN6_IDX,
    PIN7_IDX,
    PIN8_IDX,
    PIN9_IDX,
    PIN10_IDX,
    PIN11_IDX,
    PIN12_IDX,
    PIN13_IDX,
    PIN14_IDX,
    PIN15_IDX,
    PIN16_IDX,
    PIN17_IDX,
    PIN18_IDX,
    PIN19_IDX,
    PIN20_IDX,
    PIN21_IDX,
    PIN22_IDX,
    PIN23_IDX,
    PIN24_IDX,
    PIN25_IDX,
} pinIdx;

#if USE_PROTOTYPE
/**
 * \defgroup Button GPIO Configuration
 * @{
 */
#define GPIO_HOME_BUTTON_CLK_ENABLE() 	CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_HOME_BUTTON_PORT			PORTC
#define GPIO_HOME_BUTTON_GPIO  			GPIOC
#define GPIO_HOME_BUTTON_PIN			PIN5_IDX
#define GPIO_HOME_BUTTON_ALT			kPORT_MuxAsGpio
#define GPIO_HOME_BUTTON_MODE			kGPIO_DigitalInput
#define GPIO_HOME_BUTTON_INT			kPORT_InterruptFallingEdge
#define GPIO_HOME_BUTTON_INIT_VAL 		0
#define GPIO_HOME_BUTTON_PULL			kPORT_PullDisable
#define GPIO_HOME_BUTTON_SLEWRATE		kPORT_SlowSlewRate
#define GPIO_HOME_BUTTON_OPENDRAIN		kPORT_OpenDrainDisable
#define GPIO_HOME_BUTTON_DFILTER		kPORT_PassiveFilterDisable
#define GPIO_HOME_BUTTON_LOCK			kPORT_UnlockRegister
#define GPIO_HOME_BUTTON_DRIVESTRENGTH	kPORT_LowDriveStrength
/**@}*/

/**
 * \defgroup LCD GPIO Configuration
 * @{
 */
#define GPIO_TFT_RST_CLK_ENABLE() 	CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_TFT_RST_PORT			PORTC
#define GPIO_TFT_RST_GPIO  			GPIOC
#define GPIO_TFT_RST_PIN			PIN3_IDX
#define GPIO_TFT_RST_ALT			kPORT_MuxAsGpio
#define GPIO_TFT_RST_MODE			kGPIO_DigitalOutput
#define GPIO_TFT_RST_INT			0 //No interrupt
#define GPIO_TFT_RST_INIT_VAL 		0
#define GPIO_TFT_RST_PULL			kPORT_PullDisable
#define GPIO_TFT_RST_SLEWRATE		kPORT_SlowSlewRate
#define GPIO_TFT_RST_OPENDRAIN		kPORT_OpenDrainDisable
#define GPIO_TFT_RST_DFILTER		kPORT_PassiveFilterDisable
#define GPIO_TFT_RST_LOCK			kPORT_UnlockRegister
#define GPIO_TFT_RST_DRIVESTRENGTH	kPORT_LowDriveStrength

#define GPIO_TFT_BKL_CLK_ENABLE()  	CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_TFT_BKL_PORT			PORTC
#define GPIO_TFT_BKL_GPIO   		GPIOC
#define GPIO_TFT_BKL_PIN			PIN1_IDX
#define GPIO_TFT_BKL_ALT			kPORT_MuxAlt4 //PWM
#define GPIO_TFT_BKL_MODE			kGPIO_DigitalOutput
#define GPIO_TFT_BKL_INT			0 //No interrupt
#define GPIO_TFT_BKL_INIT_VAL 		0
#define GPIO_TFT_BKL_PULL			kPORT_PullDisable
#define GPIO_TFT_BKL_SLEWRATE		kPORT_SlowSlewRate
#define GPIO_TFT_BKL_OPENDRAIN		kPORT_OpenDrainDisable
#define GPIO_TFT_BKL_DFILTER		kPORT_PassiveFilterDisable
#define GPIO_TFT_BKL_LOCK			kPORT_UnlockRegister
#define GPIO_TFT_BKL_DRIVESTRENGTH	kPORT_LowDriveStrength

#define GPIO_TFT_DC_CLK_ENABLE()  	CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_TFT_DC_PORT			PORTC
#define GPIO_TFT_DC_GPIO   			GPIOC
#define GPIO_TFT_DC_PIN				PIN2_IDX
#define GPIO_TFT_DC_ALT				kPORT_MuxAsGpio
#define GPIO_TFT_DC_MODE			kGPIO_DigitalOutput
#define GPIO_TFT_DC_INT				0 //No interrupt
#define GPIO_TFT_DC_INIT_VAL 		1
#define GPIO_TFT_DC_PULL			kPORT_PullDisable
#define GPIO_TFT_DC_SLEWRATE		kPORT_SlowSlewRate
#define GPIO_TFT_DC_OPENDRAIN		kPORT_OpenDrainDisable
#define GPIO_TFT_DC_DFILTER			kPORT_PassiveFilterDisable
#define GPIO_TFT_DC_LOCK			kPORT_UnlockRegister
#define GPIO_TFT_DC_DRIVESTRENGTH	kPORT_LowDriveStrength

#define GPIO_TFT_CS_CLK_ENABLE()    CLOCK_EnableClock(kCLOCK_PortD)
#define GPIO_TFT_CS_PORT            PORTD
#define GPIO_TFT_CS_GPIO            GPIOD
#define GPIO_TFT_CS_PIN             PIN0_IDX
#define GPIO_TFT_CS_ALT             kPORT_MuxAsGpio
#define GPIO_TFT_CS_MODE            kGPIO_DigitalOutput
#define GPIO_TFT_CS_INT             0 //No interrupt
#define GPIO_TFT_CS_INIT_VAL        1
#define GPIO_TFT_CS_PULL            kPORT_PullDisable
#define GPIO_TFT_CS_SLEWRATE        kPORT_SlowSlewRate
#define GPIO_TFT_CS_OPENDRAIN       kPORT_OpenDrainDisable
#define GPIO_TFT_CS_DFILTER         kPORT_PassiveFilterDisable
#define GPIO_TFT_CS_LOCK            kPORT_UnlockRegister
#define GPIO_TFT_CS_DRIVESTRENGTH   kPORT_LowDriveStrength

#define GPIO_TFT_SO_PORT            PORTD
#define GPIO_TFT_SO_PIN             PIN2_IDX

#define GPIO_TFT_SI_PORT            PORTD
#define GPIO_TFT_SI_PIN             PIN3_IDX

