janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.h
#define GPIO_TFT_CLK_PORT           PORTD
#define GPIO_TFT_CLK_PIN            PIN1_IDX

/**@}*/

/**
 * \defgroup AFE4400 GPIO Configuration
 * @{
 */
#define GPIO_AFE4400_ADCRDY_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_AFE4400_ADCRDY_PORT           PORTC
#define GPIO_AFE4400_ADCRDY_GPIO           GPIOC
#define GPIO_AFE4400_ADCRDY_PIN            PIN4_IDX
#define GPIO_AFE4400_ADCRDY_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_ADCRDY_MODE           kGPIO_DigitalInput
#define GPIO_AFE4400_ADCRDY_INT            kPORT_InterruptRisingEdge
#define GPIO_AFE4400_ADCRDY_INIT_VAL       0
#define GPIO_AFE4400_ADCRDY_PULL           kPORT_PullDisable
#define GPIO_AFE4400_ADCRDY_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_ADCRDY_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_ADCRDY_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_ADCRDY_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_ADCRDY_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_CS_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortD)
#define GPIO_AFE4400_CS_PORT           PORTD
#define GPIO_AFE4400_CS_GPIO           GPIOD
#define GPIO_AFE4400_CS_PIN            PIN4_IDX
#define GPIO_AFE4400_CS_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_CS_MODE           kGPIO_DigitalOutput
#define GPIO_AFE4400_CS_INT            0 //No interrupt
#define GPIO_AFE4400_CS_INIT_VAL       1
#define GPIO_AFE4400_CS_PULL           kPORT_PullDisable
#define GPIO_AFE4400_CS_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_CS_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_CS_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_CS_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_CS_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_RST_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_AFE4400_RST_PORT           PORTB
#define GPIO_AFE4400_RST_GPIO           GPIOB
#define GPIO_AFE4400_RST_PIN            PIN20_IDX
#define GPIO_AFE4400_RST_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_RST_MODE           kGPIO_DigitalOutput
#define GPIO_AFE4400_RST_INT            0 //No interrupt
#define GPIO_AFE4400_RST_INIT_VAL       0
#define GPIO_AFE4400_RST_PULL           kPORT_PullDisable
#define GPIO_AFE4400_RST_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_RST_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_RST_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_RST_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_RST_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_PDN_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_AFE4400_PDN_PORT           PORTC
#define GPIO_AFE4400_PDN_GPIO           GPIOC
#define GPIO_AFE4400_PDN_PIN            PIN11_IDX
#define GPIO_AFE4400_PDN_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_PDN_MODE           kGPIO_DigitalOutput
#define GPIO_AFE4400_PDN_INT            0 //No interrupt
#define GPIO_AFE4400_PDN_INIT_VAL       0
#define GPIO_AFE4400_PDN_PULL           kPORT_PullDisable
#define GPIO_AFE4400_PDN_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_PDN_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_PDN_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_PDN_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_PDN_DRIVESTRENGTH  kPORT_LowDriveStrength
/**@}*/

/**
 * \defgroup ECG Acquisition ADC GPIO Configuration
 * @{
 */
#define GPIO_ECG_IN_CLK_ENABLE()           CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_ECG_IN_PORT                   PORTB
#define GPIO_ECG_IN_GPIO                   GPIOB
#define GPIO_ECG_IN_PIN                    PIN2_IDX
#define GPIO_ECG_IN_ALT                    kPORT_PinDisabledOrAnalog
#define GPIO_ECG_IN_ADC_BASE_ADDR          ADC0
#define GPIO_ECG_IN_ADC_CHANNEL_GROUP      0
#define GPIO_ECG_IN_ADC_CHANNEL            12
#define GPIO_ECG_IN_ADC_IRQ                ADC0_IRQn
/**@}*/

/**
 * \defgroup Touch Screen Pins
 * @{
 */
#define GPIO_ATOUCH_YP_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_ATOUCH_YP_PORT           PORTB
#define GPIO_ATOUCH_YP_GPIO           GPIOB
#define GPIO_ATOUCH_YP_PIN            PIN10_IDX
#define GPIO_ATOUCH_YP_ALT            kPORT_MuxAsGpio
#define GPIO_ATOUCH_YP_MODE           kGPIO_DigitalInput
#define GPIO_ATOUCH_YP_INT            kPORT_InterruptOrDMADisabled
#define GPIO_ATOUCH_YP_INIT_VAL       0
#define GPIO_ATOUCH_YP_PULL           kPORT_PullDisable
#define GPIO_ATOUCH_YP_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_ATOUCH_YP_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_ATOUCH_YP_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_ATOUCH_YP_LOCK           kPORT_UnlockRegister
#define GPIO_ATOUCH_YP_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_ATOUCH_YM_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_ATOUCH_YM_PORT           PORTB
#define GPIO_ATOUCH_YM_GPIO           GPIOB
#define GPIO_ATOUCH_YM_PIN            PIN19_IDX
#define GPIO_ATOUCH_YM_ALT            kPORT_MuxAsGpio
#define GPIO_ATOUCH_YM_MODE           kGPIO_DigitalInput
#define GPIO_ATOUCH_YM_INT            kPORT_InterruptOrDMADisabled
#define GPIO_ATOUCH_YM_INIT_VAL       0
#define GPIO_ATOUCH_YM_PULL           kPORT_PullDisable
#define GPIO_ATOUCH_YM_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_ATOUCH_YM_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_ATOUCH_YM_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_ATOUCH_YM_LOCK           kPORT_UnlockRegister
#define GPIO_ATOUCH_YM_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_ATOUCH_XP_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_ATOUCH_XP_PORT           PORTB
#define GPIO_ATOUCH_XP_GPIO           GPIOB
#define GPIO_ATOUCH_XP_PIN            PIN18_IDX
#define GPIO_ATOUCH_XP_ALT            kPORT_MuxAsGpio
#define GPIO_ATOUCH_XP_MODE           kGPIO_DigitalInput
#define GPIO_ATOUCH_XP_INT            kPORT_InterruptOrDMADisabled
#define GPIO_ATOUCH_XP_INIT_VAL       0
#define GPIO_ATOUCH_XP_PULL           kPORT_PullDisable
#define GPIO_ATOUCH_XP_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_ATOUCH_XP_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_ATOUCH_XP_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_ATOUCH_XP_LOCK           kPORT_UnlockRegister
#define GPIO_ATOUCH_XP_DRIVESTRENGTH  kPORT_LowDriveStrength

