janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.h
#define GPIO_ATOUCH_XM_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_ATOUCH_XM_PORT           PORTB
#define GPIO_ATOUCH_XM_GPIO           GPIOB
#define GPIO_ATOUCH_XM_PIN            PIN11_IDX
#define GPIO_ATOUCH_XM_ALT            kPORT_MuxAsGpio
#define GPIO_ATOUCH_XM_MODE           kGPIO_DigitalInput
#define GPIO_ATOUCH_XM_INT            kPORT_InterruptOrDMADisabled
#define GPIO_ATOUCH_XM_INIT_VAL       0
#define GPIO_ATOUCH_XM_PULL           kPORT_PullDisable
#define GPIO_ATOUCH_XM_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_ATOUCH_XM_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_ATOUCH_XM_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_ATOUCH_XM_LOCK           kPORT_UnlockRegister
#define GPIO_ATOUCH_XM_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_ATOUCH_BASE_ADDR              ADC1
#define GPIO_ATOUCH_ADC_CHANNEL_GROUP      0
#define GPIO_ATOUCH_ADC_XM_CHANNEL         15
#define GPIO_ATOUCH_ADC_YP_CHANNEL         14
#define GPIO_ATOUCH_ADC_IRQ                ADC1_IRQn
/**@}*/

/**
 * \defgroup TSC2007 Touch Controller Configuration
 * @{
 */
#define GPIO_TOUCH_PEN_IRQ_CLK_ENABLE() 	CLOCK_EnableClock(kCLOCK_PortA)
#define GPIO_TOUCH_PEN_IRQ_PORT				PORTA
#define GPIO_TOUCH_PEN_IRQ_GPIO  			GPIOA
#define GPIO_TOUCH_PEN_IRQ_PIN				PIN13_IDX
#define GPIO_TOUCH_PEN_IRQ_ALT				kPORT_MuxAsGpio
#define GPIO_TOUCH_PEN_IRQ_MODE				kGPIO_DigitalInput
#define GPIO_TOUCH_PEN_IRQ_INT				kPORT_InterruptFallingEdge
#define GPIO_TOUCH_PEN_IRQ_INIT_VAL 		0
#define GPIO_TOUCH_PEN_IRQ_PULL				kPORT_PullDisable
#define GPIO_TOUCH_PEN_IRQ_SLEWRATE			kPORT_SlowSlewRate
#define GPIO_TOUCH_PEN_IRQ_OPENDRAIN		kPORT_OpenDrainDisable
#define GPIO_TOUCH_PEN_IRQ_DFILTER			kPORT_PassiveFilterDisable
#define GPIO_TOUCH_PEN_IRQ_LOCK				kPORT_UnlockRegister
#define GPIO_TOUCH_PEN_IRQ_DRIVESTRENGTH	kPORT_LowDriveStrength
#define GPIO_TOUCH_PEN_IRQn					PORTA_IRQn
/**@}*/

#else
/**
 * \defgroup LCD GPIO Configuration
 * @{
 */
#define GPIO_TFT_RST_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortA)
#define GPIO_TFT_RST_PORT           PORTA
#define GPIO_TFT_RST_GPIO           GPIOA
#define GPIO_TFT_RST_PIN            PIN15_IDX
#define GPIO_TFT_RST_ALT            kPORT_MuxAsGpio
#define GPIO_TFT_RST_MODE           kGPIO_DigitalOutput
#define GPIO_TFT_RST_INT            0 //No interrupt
#define GPIO_TFT_RST_INIT_VAL       0
#define GPIO_TFT_RST_PULL           kPORT_PullDisable
#define GPIO_TFT_RST_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_TFT_RST_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_TFT_RST_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_TFT_RST_LOCK           kPORT_UnlockRegister
#define GPIO_TFT_RST_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_TFT_BKL_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_TFT_BKL_PORT           PORTC
#define GPIO_TFT_BKL_GPIO           GPIOC
#define GPIO_TFT_BKL_PIN            PIN1_IDX
#define GPIO_TFT_BKL_ALT            kPORT_MuxAlt4 //PWM
#define GPIO_TFT_BKL_MODE           kGPIO_DigitalOutput
#define GPIO_TFT_BKL_INT            0 //No interrupt
#define GPIO_TFT_BKL_INIT_VAL       0
#define GPIO_TFT_BKL_PULL           kPORT_PullDisable
#define GPIO_TFT_BKL_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_TFT_BKL_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_TFT_BKL_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_TFT_BKL_LOCK           kPORT_UnlockRegister
#define GPIO_TFT_BKL_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_TFT_DC_CLK_ENABLE()    CLOCK_EnableClock(kCLOCK_PortA)
#define GPIO_TFT_DC_PORT            PORTA
#define GPIO_TFT_DC_GPIO            GPIOA
#define GPIO_TFT_DC_PIN             PIN14_IDX
#define GPIO_TFT_DC_ALT             kPORT_MuxAsGpio
#define GPIO_TFT_DC_MODE            kGPIO_DigitalOutput
#define GPIO_TFT_DC_INT             0 //No interrupt
#define GPIO_TFT_DC_INIT_VAL        1
#define GPIO_TFT_DC_PULL            kPORT_PullDisable
#define GPIO_TFT_DC_SLEWRATE        kPORT_SlowSlewRate
#define GPIO_TFT_DC_OPENDRAIN       kPORT_OpenDrainDisable
#define GPIO_TFT_DC_DFILTER         kPORT_PassiveFilterDisable
#define GPIO_TFT_DC_LOCK            kPORT_UnlockRegister
#define GPIO_TFT_DC_DRIVESTRENGTH   kPORT_LowDriveStrength

#define GPIO_TFT_CS_CLK_ENABLE()    CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_TFT_CS_PORT            PORTB
#define GPIO_TFT_CS_GPIO            GPIOB
#define GPIO_TFT_CS_PIN             PIN20_IDX
#define GPIO_TFT_CS_ALT             kPORT_MuxAsGpio
#define GPIO_TFT_CS_MODE            kGPIO_DigitalOutput
#define GPIO_TFT_CS_INT             0 //No interrupt
#define GPIO_TFT_CS_INIT_VAL        1
#define GPIO_TFT_CS_PULL            kPORT_PullDisable
#define GPIO_TFT_CS_SLEWRATE        kPORT_SlowSlewRate
#define GPIO_TFT_CS_OPENDRAIN       kPORT_OpenDrainDisable
#define GPIO_TFT_CS_DFILTER         kPORT_PassiveFilterDisable
#define GPIO_TFT_CS_LOCK            kPORT_UnlockRegister
#define GPIO_TFT_CS_DRIVESTRENGTH   kPORT_LowDriveStrength

/**@}*/

/**
 * \defgroup AFE4400 GPIO Configuration
 * @{
 */
#define GPIO_AFE4400_ADCRDY_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_AFE4400_ADCRDY_PORT           PORTC
#define GPIO_AFE4400_ADCRDY_GPIO           GPIOC
#define GPIO_AFE4400_ADCRDY_PIN            PIN3_IDX
#define GPIO_AFE4400_ADCRDY_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_ADCRDY_MODE           kGPIO_DigitalInput
#define GPIO_AFE4400_ADCRDY_INT            kPORT_InterruptRisingEdge
#define GPIO_AFE4400_ADCRDY_INIT_VAL       0
#define GPIO_AFE4400_ADCRDY_PULL           kPORT_PullDisable
#define GPIO_AFE4400_ADCRDY_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_ADCRDY_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_ADCRDY_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_ADCRDY_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_ADCRDY_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_PDALM_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_AFE4400_PDALM_PORT           PORTC
#define GPIO_AFE4400_PDALM_GPIO           GPIOC
#define GPIO_AFE4400_PDALM_PIN            PIN4_IDX
#define GPIO_AFE4400_PDALM_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_PDALM_MODE           kGPIO_DigitalInput
#define GPIO_AFE4400_PDALM_INT            kPORT_InterruptRisingEdge
#define GPIO_AFE4400_PDALM_INIT_VAL       0
#define GPIO_AFE4400_PDALM_PULL           kPORT_PullDisable
#define GPIO_AFE4400_PDALM_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_PDALM_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_PDALM_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_PDALM_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_PDALM_DRIVESTRENGTH  kPORT_LowDriveStrength

