janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.h
#define GPIO_AFE4400_DIAGEND_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_AFE4400_DIAGEND_PORT           PORTC
#define GPIO_AFE4400_DIAGEND_GPIO           GPIOC
#define GPIO_AFE4400_DIAGEND_PIN            PIN5_IDX
#define GPIO_AFE4400_DIAGEND_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_DIAGEND_MODE           kGPIO_DigitalInput
#define GPIO_AFE4400_DIAGEND_INT            kPORT_InterruptRisingEdge
#define GPIO_AFE4400_DIAGEND_INIT_VAL       0
#define GPIO_AFE4400_DIAGEND_PULL           kPORT_PullDisable
#define GPIO_AFE4400_DIAGEND_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_DIAGEND_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_DIAGEND_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_DIAGEND_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_DIAGEND_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_LEDALM_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_AFE4400_LEDALM_PORT           PORTC
#define GPIO_AFE4400_LEDALM_GPIO           GPIOC
#define GPIO_AFE4400_LEDALM_PIN            PIN6_IDX
#define GPIO_AFE4400_LEDALM_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_LEDALM_MODE           kGPIO_DigitalInput
#define GPIO_AFE4400_LEDALM_INT            kPORT_InterruptRisingEdge
#define GPIO_AFE4400_LEDALM_INIT_VAL       0
#define GPIO_AFE4400_LEDALM_PULL           kPORT_PullDisable
#define GPIO_AFE4400_LEDALM_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_LEDALM_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_LEDALM_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_LEDALM_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_LEDALM_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_CS_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_AFE4400_CS_PORT           PORTB
#define GPIO_AFE4400_CS_GPIO           GPIOB
#define GPIO_AFE4400_CS_PIN            PIN10_IDX
#define GPIO_AFE4400_CS_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_CS_MODE           kGPIO_DigitalOutput
#define GPIO_AFE4400_CS_INT            0 //No interrupt
#define GPIO_AFE4400_CS_INIT_VAL       1
#define GPIO_AFE4400_CS_PULL           kPORT_PullDisable
#define GPIO_AFE4400_CS_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_CS_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_CS_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_CS_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_CS_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_RST_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortA)
#define GPIO_AFE4400_RST_PORT           PORTA
#define GPIO_AFE4400_RST_GPIO           GPIOA
#define GPIO_AFE4400_RST_PIN            PIN16_IDX
#define GPIO_AFE4400_RST_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_RST_MODE           kGPIO_DigitalOutput
#define GPIO_AFE4400_RST_INT            0 //No interrupt
#define GPIO_AFE4400_RST_INIT_VAL       0
#define GPIO_AFE4400_RST_PULL           kPORT_PullDisable
#define GPIO_AFE4400_RST_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_RST_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_RST_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_RST_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_RST_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_PDN_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortA)
#define GPIO_AFE4400_PDN_PORT           PORTA
#define GPIO_AFE4400_PDN_GPIO           GPIOA
#define GPIO_AFE4400_PDN_PIN            PIN17_IDX
#define GPIO_AFE4400_PDN_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_PDN_MODE           kGPIO_DigitalOutput
#define GPIO_AFE4400_PDN_INT            0 //No interrupt
#define GPIO_AFE4400_PDN_INIT_VAL       0
#define GPIO_AFE4400_PDN_PULL           kPORT_PullDisable
#define GPIO_AFE4400_PDN_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_PDN_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_PDN_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_PDN_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_PDN_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_AFE4400_POWER_EN_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_AFE4400_POWER_EN_PORT           PORTB
#define GPIO_AFE4400_POWER_EN_GPIO           GPIOB
#define GPIO_AFE4400_POWER_EN_PIN            PIN1_IDX
#define GPIO_AFE4400_POWER_EN_ALT            kPORT_MuxAsGpio
#define GPIO_AFE4400_POWER_EN_MODE           kGPIO_DigitalOutput
#define GPIO_AFE4400_POWER_EN_INT            0 //No interrupt
#define GPIO_AFE4400_POWER_EN_INIT_VAL       1
#define GPIO_AFE4400_POWER_EN_PULL           kPORT_PullDisable
#define GPIO_AFE4400_POWER_EN_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_AFE4400_POWER_EN_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_AFE4400_POWER_EN_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_AFE4400_POWER_EN_LOCK           kPORT_UnlockRegister
#define GPIO_AFE4400_POWER_EN_DRIVESTRENGTH  kPORT_HighDriveStrength
/**@}*/

/**
 * \defgroup ECG Acquisition ADC GPIO Configuration
 * @{
 */
#define GPIO_ECG_POWER_EN_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_ECG_POWER_EN_PORT           PORTC
#define GPIO_ECG_POWER_EN_GPIO           GPIOC
#define GPIO_ECG_POWER_EN_PIN            PIN18_IDX
#define GPIO_ECG_POWER_EN_ALT            kPORT_MuxAsGpio
#define GPIO_ECG_POWER_EN_MODE           kGPIO_DigitalOutput
#define GPIO_ECG_POWER_EN_INT            0 //No interrupt
#define GPIO_ECG_POWER_EN_INIT_VAL       0
#define GPIO_ECG_POWER_EN_PULL           kPORT_PullDisable
#define GPIO_ECG_POWER_EN_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_ECG_POWER_EN_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_ECG_POWER_EN_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_ECG_POWER_EN_LOCK           kPORT_UnlockRegister
#define GPIO_ECG_POWER_EN_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_ECG_IN_CLK_ENABLE()           CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_ECG_IN_ALT                    kPORT_PinDisabledOrAnalog
#define GPIO_ECG_IN_ADC_BASE_ADDR          ADC0
#define GPIO_ECG_IN_ADC_CHANNEL_GROUP      0
#define GPIO_ECG_IN_ADC_CHANNEL            23
#define GPIO_ECG_IN_ADC_IRQ                ADC0_IRQn

#define GPIO_ECG_IN_NFILT_CLK_ENABLE()           CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_ECG_IN_NFILT_PORT                   PORTB
#define GPIO_ECG_IN_NFILT_GPIO                   GPIOB
#define GPIO_ECG_IN_NFILT_PIN                    PIN3_IDX
#define GPIO_ECG_IN_NFILT_ALT                    kPORT_PinDisabledOrAnalog
#define GPIO_ECG_IN_NFILT_ADC_BASE_ADDR          ADC0
#define GPIO_ECG_IN_NFILT_ADC_CHANNEL_GROUP      0
#define GPIO_ECG_IN_NFILT_ADC_CHANNEL            13
#define GPIO_ECG_IN_NFILT_ADC_IRQ                ADC0_IRQn
/**@}*/

/**
 * \defgroup TSC2007 Touch Controller Configuration
 * @{
 */
#define GPIO_TOUCH_PEN_IRQ_CLK_ENABLE()     CLOCK_EnableClock(kCLOCK_PortA)
#define GPIO_TOUCH_PEN_IRQ_PORT             PORTA
#define GPIO_TOUCH_PEN_IRQ_GPIO             GPIOA
#define GPIO_TOUCH_PEN_IRQ_PIN              PIN13_IDX
#define GPIO_TOUCH_PEN_IRQ_ALT              kPORT_MuxAsGpio
#define GPIO_TOUCH_PEN_IRQ_MODE             kGPIO_DigitalInput
#define GPIO_TOUCH_PEN_IRQ_INT              kPORT_InterruptFallingEdge
#define GPIO_TOUCH_PEN_IRQ_INIT_VAL         0
#define GPIO_TOUCH_PEN_IRQ_PULL             kPORT_PullDisable
#define GPIO_TOUCH_PEN_IRQ_SLEWRATE         kPORT_SlowSlewRate
#define GPIO_TOUCH_PEN_IRQ_OPENDRAIN        kPORT_OpenDrainDisable
#define GPIO_TOUCH_PEN_IRQ_DFILTER          kPORT_PassiveFilterDisable
#define GPIO_TOUCH_PEN_IRQ_LOCK             kPORT_UnlockRegister
#define GPIO_TOUCH_PEN_IRQ_DRIVESTRENGTH    kPORT_LowDriveStrength
#define GPIO_TOUCH_PEN_IRQn                 PORTA_IRQn
/**@}*/

/**
 * \defgroup BQ27441 Battery Gauge Configuration
 * @{
 */
#define GPIO_GAUGE_GPOUT_CLK_ENABLE()     CLOCK_EnableClock(kCLOCK_PortA)
#define GPIO_GAUGE_GPOUT_PORT             PORTA
#define GPIO_GAUGE_GPOUT_GPIO             GPIOA
#define GPIO_GAUGE_GPOUT_PIN              PIN4_IDX
#define GPIO_GAUGE_GPOUT_ALT              kPORT_MuxAsGpio
#define GPIO_GAUGE_GPOUT_MODE             kGPIO_DigitalInput
#define GPIO_GAUGE_GPOUT_INT              kPORT_InterruptFallingEdge
#define GPIO_GAUGE_GPOUT_INIT_VAL         0
#define GPIO_GAUGE_GPOUT_PULL             kPORT_PullDisable
#define GPIO_GAUGE_GPOUT_SLEWRATE         kPORT_SlowSlewRate
#define GPIO_GAUGE_GPOUT_OPENDRAIN        kPORT_OpenDrainDisable
#define GPIO_GAUGE_GPOUT_DFILTER          kPORT_PassiveFilterDisable
#define GPIO_GAUGE_GPOUT_LOCK             kPORT_UnlockRegister
#define GPIO_GAUGE_GPOUT_DRIVESTRENGTH    kPORT_LowDriveStrength
#define GPIO_GAUGE_GPOUT_IRQn             PORTA_IRQn
/**@}*/

/**
 * \defgroup BQ24075 Battery Charger Configuration
 * @{
 */
#define GPIO_CHG_SYSOFF_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_CHG_SYSOFF_PORT           PORTC
#define GPIO_CHG_SYSOFF_GPIO           GPIOC
#define GPIO_CHG_SYSOFF_PIN            PIN7_IDX
#define GPIO_CHG_SYSOFF_ALT            kPORT_MuxAsGpio
#define GPIO_CHG_SYSOFF_MODE           kGPIO_DigitalOutput
#define GPIO_CHG_SYSOFF_INT            0 //No interrupt
#define GPIO_CHG_SYSOFF_INIT_VAL       0
#define GPIO_CHG_SYSOFF_PULL           kPORT_PullDisable
#define GPIO_CHG_SYSOFF_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_CHG_SYSOFF_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_CHG_SYSOFF_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_CHG_SYSOFF_LOCK           kPORT_UnlockRegister
#define GPIO_CHG_SYSOFF_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_CHG_CE_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_CHG_CE_PORT           PORTC
#define GPIO_CHG_CE_GPIO           GPIOC
#define GPIO_CHG_CE_PIN            PIN8_IDX
#define GPIO_CHG_CE_ALT            kPORT_MuxAsGpio
#define GPIO_CHG_CE_MODE           kGPIO_DigitalOutput
#define GPIO_CHG_CE_INT            0 //No interrupt
#define GPIO_CHG_CE_INIT_VAL       0
#define GPIO_CHG_CE_PULL           kPORT_PullDisable
#define GPIO_CHG_CE_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_CHG_CE_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_CHG_CE_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_CHG_CE_LOCK           kPORT_UnlockRegister
#define GPIO_CHG_CE_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_CHG_EN1_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_CHG_EN1_PORT           PORTC
#define GPIO_CHG_EN1_GPIO           GPIOC
#define GPIO_CHG_EN1_PIN            PIN12_IDX
#define GPIO_CHG_EN1_ALT            kPORT_MuxAsGpio
#define GPIO_CHG_EN1_MODE           kGPIO_DigitalOutput
#define GPIO_CHG_EN1_INT            0 //No interrupt
#define GPIO_CHG_EN1_INIT_VAL       0
#define GPIO_CHG_EN1_PULL           kPORT_PullDisable
#define GPIO_CHG_EN1_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_CHG_EN1_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_CHG_EN1_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_CHG_EN1_LOCK           kPORT_UnlockRegister
#define GPIO_CHG_EN1_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_CHG_EN2_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_CHG_EN2_PORT           PORTC
#define GPIO_CHG_EN2_GPIO           GPIOC
#define GPIO_CHG_EN2_PIN            PIN13_IDX
#define GPIO_CHG_EN2_ALT            kPORT_MuxAsGpio
#define GPIO_CHG_EN2_MODE           kGPIO_DigitalOutput
#define GPIO_CHG_EN2_INT            0 //No interrupt
#define GPIO_CHG_EN2_INIT_VAL       1
#define GPIO_CHG_EN2_PULL           kPORT_PullDisable
#define GPIO_CHG_EN2_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_CHG_EN2_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_CHG_EN2_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_CHG_EN2_LOCK           kPORT_UnlockRegister
#define GPIO_CHG_EN2_DRIVESTRENGTH  kPORT_LowDriveStrength

#define GPIO_CHG_PGOOD_CLK_ENABLE()     CLOCK_EnableClock(kCLOCK_PortD)
#define GPIO_CHG_PGOOD_PORT             PORTD
#define GPIO_CHG_PGOOD_GPIO             GPIOD
#define GPIO_CHG_PGOOD_PIN              PIN6_IDX
#define GPIO_CHG_PGOOD_ALT              kPORT_MuxAsGpio
#define GPIO_CHG_PGOOD_MODE             kGPIO_DigitalInput
#define GPIO_CHG_PGOOD_INT              kPORT_InterruptFallingEdge
#define GPIO_CHG_PGOOD_INIT_VAL         0
#define GPIO_CHG_PGOOD_PULL             kPORT_PullDisable
#define GPIO_CHG_PGOOD_SLEWRATE         kPORT_SlowSlewRate
#define GPIO_CHG_PGOOD_OPENDRAIN        kPORT_OpenDrainDisable
#define GPIO_CHG_PGOOD_DFILTER          kPORT_PassiveFilterDisable
#define GPIO_CHG_PGOOD_LOCK             kPORT_UnlockRegister
#define GPIO_CHG_PGOOD_DRIVESTRENGTH    kPORT_LowDriveStrength

#define GPIO_CHG_CHARGING_CLK_ENABLE()     CLOCK_EnableClock(kCLOCK_PortB)
#define GPIO_CHG_CHARGING_PORT             PORTB
#define GPIO_CHG_CHARGING_GPIO             GPIOB
#define GPIO_CHG_CHARGING_PIN              PIN0_IDX
#define GPIO_CHG_CHARGING_ALT              kPORT_MuxAsGpio
#define GPIO_CHG_CHARGING_MODE             kGPIO_DigitalInput
#define GPIO_CHG_CHARGING_INT              kPORT_InterruptFallingEdge
#define GPIO_CHG_CHARGING_INIT_VAL         0
#define GPIO_CHG_CHARGING_PULL             kPORT_PullDisable
#define GPIO_CHG_CHARGING_SLEWRATE         kPORT_SlowSlewRate
#define GPIO_CHG_CHARGING_OPENDRAIN        kPORT_OpenDrainDisable
#define GPIO_CHG_CHARGING_DFILTER          kPORT_PassiveFilterDisable
#define GPIO_CHG_CHARGING_LOCK             kPORT_UnlockRegister
#define GPIO_CHG_CHARGING_DRIVESTRENGTH    kPORT_LowDriveStrength
/**@}*/

/**
 * \defgroup SPI FLash Configuration
 * @{
 */
#define GPIO_FLASH_RST_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_FLASH_RST_PORT           PORTC
#define GPIO_FLASH_RST_GPIO           GPIOC
#define GPIO_FLASH_RST_PIN            PIN16_IDX
#define GPIO_FLASH_RST_ALT            kPORT_MuxAsGpio
#define GPIO_FLASH_RST_MODE           kGPIO_DigitalOutput
#define GPIO_FLASH_RST_INT            0 //No interrupt
#define GPIO_FLASH_RST_INIT_VAL       0
#define GPIO_FLASH_RST_PULL           kPORT_PullDisable
#define GPIO_FLASH_RST_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_FLASH_RST_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_FLASH_RST_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_FLASH_RST_LOCK           kPORT_UnlockRegister
#define GPIO_FLASH_RST_DRIVESTRENGTH  kPORT_LowDriveStrength

