janhocn/ECG_TCC/ECG_TCC/frdmk64f/pin_mux.h
#define GPIO_FLASH_WP_CLK_ENABLE()   CLOCK_EnableClock(kCLOCK_PortC)
#define GPIO_FLASH_WP_PORT           PORTC
#define GPIO_FLASH_WP_GPIO           GPIOC
#define GPIO_FLASH_WP_PIN            PIN17_IDX
#define GPIO_FLASH_WP_ALT            kPORT_MuxAsGpio
#define GPIO_FLASH_WP_MODE           kGPIO_DigitalOutput
#define GPIO_FLASH_WP_INT            0 //No interrupt
#define GPIO_FLASH_WP_INIT_VAL       0
#define GPIO_FLASH_WP_PULL           kPORT_PullDisable
#define GPIO_FLASH_WP_SLEWRATE       kPORT_SlowSlewRate
#define GPIO_FLASH_WP_OPENDRAIN      kPORT_OpenDrainDisable
#define GPIO_FLASH_WP_DFILTER        kPORT_PassiveFilterDisable
#define GPIO_FLASH_WP_LOCK           kPORT_UnlockRegister
#define GPIO_FLASH_WP_DRIVESTRENGTH  kPORT_LowDriveStrength


/**@}*/

#endif

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void SDHC_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void BOARD_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Calls initialization functions.
 * @return void
 */
void BOARD_InitBootPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void HOMEButton_InitPin(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void ECGACQ_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void TFT_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void DSPI0_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void DSPI0_DeinitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void DSPI1_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void DSPI1_DeinitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void DSPI2_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void DSPI2_DeinitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void I2C0_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void I2C0_DeinitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void I2C1_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void I2C1_DeinitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void AFE4400_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void TSC2007_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void BQ27441_InitPins(void);

/*************************************************************************************************/
/**
 * @brief Configures pin routing and optionally pin electrical features.
 * @return void
 */
void BQ4075_InitPins(void);
#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
